{
  "char2id": {
    "<PAD>": 0,
    "<BOS>": 1,
    "<EOS>": 2,
    "<UNK>": 3,
    "e": 4,
    "a": 5,
    "n": 6,
    "r": 7,
    "i": 8,
    "o": 9,
    "t": 10,
    "s": 11,
    "l": 12,
    "d": 13,
    "u": 14,
    "c": 15,
    "h": 16,
    "m": 17,
    "p": 18,
    "g": 19,
    "b": 20,
    "f": 21,
    ",": 22,
    ".": 23,
    "y": 24,
    "v": 25,
    "w": 26,
    "k": 27,
    "z": 28,
    "q": 29,
    "ó": 30,
    "S": 31,
    "A": 32,
    "-": 33,
    "\"": 34,
    "0": 35,
    "E": 36,
    "é": 37,
    "j": 38,
    "M": 39,
    "I": 40,
    "1": 41,
    "P": 42,
    "B": 43,
    "í": 44,
    "C": 45,
    "D": 46,
    "T": 47,
    "ü": 48,
    "á": 49,
    "G": 50,
    "L": 51,
    "F": 52,
    "R": 53,
    "x": 54,
    "ä": 55,
    "2": 56,
    "9": 57,
    "H": 58,
    "K": 59,
    "N": 60,
    "ñ": 61,
    "W": 62,
    "J": 63,
    ")": 64,
    "V": 65,
    "(": 66,
    "O": 67,
    "U": 68,
    "3": 69,
    "5": 70,
    "ö": 71,
    "'": 72,
    "8": 73,
    "4": 74,
    "ú": 75,
    "6": 76,
    "7": 77,
    ":": 78,
    "ß": 79,
    "!": 80,
    "Z": 81,
    "/": 82,
    "?": 83,
    "Y": 84,
    "`": 85,
    "_": 86,
    "=": 87,
    ";": 88,
    "Q": 89,
    "*": 90,
    "%": 91,
    "X": 92,
    "$": 93,
    "&": 94,
    "¿": 95,
    "@": 96,
    "Ü": 97,
    ">": 98,
    "<": 99,
    "Ö": 100,
    "+": 101,
    "ç": 102,
    "à": 103,
    "Ä": 104,
    "#": 105,
    "è": 106,
    "[": 107,
    "]": 108,
    "¡": 109,
    "’": 110,
    "É": 111,
    "°": 112,
    "²": 113,
    "ō": 114,
    "|": 115,
    "Á": 116,
    "č": 117,
    "ò": 118,
    "â": 119,
    "š": 120,
    "~": 121,
    "å": 122,
    "Ó": 123,
    "ô": 124,
    "“": 125,
    "”": 126,
    "ę": 127,
    "«": 128,
    "»": 129,
    "ž": 130,
    "ū": 131,
    "€": 132,
    "ø": 133,
    "ř": 134,
    "ï": 135,
    "^": 136,
    "ł": 137,
    "ı": 138,
    "ý": 139,
    "·": 140,
    "ś": 141,
    "†": 142,
    "ć": 143,
    "Í": 144,
    "μ": 145,
    "×": 146,
    "ş": 147,
    "æ": 148,
    "{": 149,
    "Č": 150,
    "ą": 151,
    "ń": 152,
    "ě": 153,
    "Ú": 154,
    "}": 155,
    "‘": 156,
    "î": 157,
    "ð": 158,
    "ā": 159,
    "Ł": 160,
    "ă": 161,
    "—": 162,
    "е": 163,
    "α": 164,
    "–": 165,
    "Š": 166,
    "§": 167,
    "Ç": 168,
    "ã": 169,
    "ů": 170,
    "→": 171,
    "£": 172,
    "ŏ": 173,
    "Ñ": 174,
    "Ò": 175,
    "…": 176,
    "Ş": 177,
    "½": 178,
    "Ž": 179,
    "ź": 180,
    "Ō": 181,
    "Î": 182,
    "ī": 183,
    "ē": 184,
    "ë": 185,
    "ɛ": 186,
    "º": 187,
    "³": 188,
    "´": 189,
    "İ": 190,
    "ê": 191,
    "а": 192,
    "т": 193,
    "н": 194,
    "л": 195,
    "ğ": 196,
    "δ": 197,
    "ρ": 198,
    "σ": 199,
    "Æ": 200,
    "ả": 201,
    "ʿ": 202,
    "λ": 203,
    "ệ": 204,
    "Þ": 205,
    "Ţ": 206,
    "đ": 207,
    "µ": 208,
    "ő": 209,
    "Т": 210,
    "ш": 211,
    "В": 212,
    "Е": 213,
    "Ц": 214,
    "ʂ": 215,
    "ù": 216,
    "\\": 217,
    "™": 218,
    "ď": 219,
    "ż": 220,
    "М": 221,
    "у": 222,
    "с": 223,
    "к": 224,
    "О": 225,
    "о": 226,
    "Γ": 227,
    "ϊ": 228,
    "ο": 229,
    "ν": 230,
    "ί": 231,
    "ι": 232,
    "ľ": 233,
    "õ": 234,
    "ḥ": 235,
    "ṯ": 236,
    "ė": 237,
    "Ω": 238,
    "ά": 239,
    "Â": 240,
    "ţ": 241,
    "π": 242,
    "ķ": 243,
    "÷": 244,
    "ה": 245,
    "ש": 246,
    "ם": 247,
    "Σ": 248,
    "κ": 249,
    "έ": 250,
    "ς": 251,
    "®": 252,
    "њ": 253,
    "Ś": 254,
    "¾": 255,
    "ω": 256,
    "Ǩ": 257,
    "ṫ": 258,
    "‰": 259,
    "ổ": 260,
    "œ": 261,
    "快": 262,
    "速": 263,
    "公": 264,
    "路": 265,
    "ň": 266,
    "Д": 267,
    "в": 268,
    "и": 269,
    "͡": 270,
    "ª": 271,
    "♥": 272,
    "Ã": 273,
    "­": 274,
    "Υ": 275
  },
  "id2char": {
    "0": "<PAD>",
    "1": "<BOS>",
    "2": "<EOS>",
    "3": "<UNK>",
    "4": "e",
    "5": "a",
    "6": "n",
    "7": "r",
    "8": "i",
    "9": "o",
    "10": "t",
    "11": "s",
    "12": "l",
    "13": "d",
    "14": "u",
    "15": "c",
    "16": "h",
    "17": "m",
    "18": "p",
    "19": "g",
    "20": "b",
    "21": "f",
    "22": ",",
    "23": ".",
    "24": "y",
    "25": "v",
    "26": "w",
    "27": "k",
    "28": "z",
    "29": "q",
    "30": "ó",
    "31": "S",
    "32": "A",
    "33": "-",
    "34": "\"",
    "35": "0",
    "36": "E",
    "37": "é",
    "38": "j",
    "39": "M",
    "40": "I",
    "41": "1",
    "42": "P",
    "43": "B",
    "44": "í",
    "45": "C",
    "46": "D",
    "47": "T",
    "48": "ü",
    "49": "á",
    "50": "G",
    "51": "L",
    "52": "F",
    "53": "R",
    "54": "x",
    "55": "ä",
    "56": "2",
    "57": "9",
    "58": "H",
    "59": "K",
    "60": "N",
    "61": "ñ",
    "62": "W",
    "63": "J",
    "64": ")",
    "65": "V",
    "66": "(",
    "67": "O",
    "68": "U",
    "69": "3",
    "70": "5",
    "71": "ö",
    "72": "'",
    "73": "8",
    "74": "4",
    "75": "ú",
    "76": "6",
    "77": "7",
    "78": ":",
    "79": "ß",
    "80": "!",
    "81": "Z",
    "82": "/",
    "83": "?",
    "84": "Y",
    "85": "`",
    "86": "_",
    "87": "=",
    "88": ";",
    "89": "Q",
    "90": "*",
    "91": "%",
    "92": "X",
    "93": "$",
    "94": "&",
    "95": "¿",
    "96": "@",
    "97": "Ü",
    "98": ">",
    "99": "<",
    "100": "Ö",
    "101": "+",
    "102": "ç",
    "103": "à",
    "104": "Ä",
    "105": "#",
    "106": "è",
    "107": "[",
    "108": "]",
    "109": "¡",
    "110": "’",
    "111": "É",
    "112": "°",
    "113": "²",
    "114": "ō",
    "115": "|",
    "116": "Á",
    "117": "č",
    "118": "ò",
    "119": "â",
    "120": "š",
    "121": "~",
    "122": "å",
    "123": "Ó",
    "124": "ô",
    "125": "“",
    "126": "”",
    "127": "ę",
    "128": "«",
    "129": "»",
    "130": "ž",
    "131": "ū",
    "132": "€",
    "133": "ø",
    "134": "ř",
    "135": "ï",
    "136": "^",
    "137": "ł",
    "138": "ı",
    "139": "ý",
    "140": "·",
    "141": "ś",
    "142": "†",
    "143": "ć",
    "144": "Í",
    "145": "μ",
    "146": "×",
    "147": "ş",
    "148": "æ",
    "149": "{",
    "150": "Č",
    "151": "ą",
    "152": "ń",
    "153": "ě",
    "154": "Ú",
    "155": "}",
    "156": "‘",
    "157": "î",
    "158": "ð",
    "159": "ā",
    "160": "Ł",
    "161": "ă",
    "162": "—",
    "163": "е",
    "164": "α",
    "165": "–",
    "166": "Š",
    "167": "§",
    "168": "Ç",
    "169": "ã",
    "170": "ů",
    "171": "→",
    "172": "£",
    "173": "ŏ",
    "174": "Ñ",
    "175": "Ò",
    "176": "…",
    "177": "Ş",
    "178": "½",
    "179": "Ž",
    "180": "ź",
    "181": "Ō",
    "182": "Î",
    "183": "ī",
    "184": "ē",
    "185": "ë",
    "186": "ɛ",
    "187": "º",
    "188": "³",
    "189": "´",
    "190": "İ",
    "191": "ê",
    "192": "а",
    "193": "т",
    "194": "н",
    "195": "л",
    "196": "ğ",
    "197": "δ",
    "198": "ρ",
    "199": "σ",
    "200": "Æ",
    "201": "ả",
    "202": "ʿ",
    "203": "λ",
    "204": "ệ",
    "205": "Þ",
    "206": "Ţ",
    "207": "đ",
    "208": "µ",
    "209": "ő",
    "210": "Т",
    "211": "ш",
    "212": "В",
    "213": "Е",
    "214": "Ц",
    "215": "ʂ",
    "216": "ù",
    "217": "\\",
    "218": "™",
    "219": "ď",
    "220": "ż",
    "221": "М",
    "222": "у",
    "223": "с",
    "224": "к",
    "225": "О",
    "226": "о",
    "227": "Γ",
    "228": "ϊ",
    "229": "ο",
    "230": "ν",
    "231": "ί",
    "232": "ι",
    "233": "ľ",
    "234": "õ",
    "235": "ḥ",
    "236": "ṯ",
    "237": "ė",
    "238": "Ω",
    "239": "ά",
    "240": "Â",
    "241": "ţ",
    "242": "π",
    "243": "ķ",
    "244": "÷",
    "245": "ה",
    "246": "ש",
    "247": "ם",
    "248": "Σ",
    "249": "κ",
    "250": "έ",
    "251": "ς",
    "252": "®",
    "253": "њ",
    "254": "Ś",
    "255": "¾",
    "256": "ω",
    "257": "Ǩ",
    "258": "ṫ",
    "259": "‰",
    "260": "ổ",
    "261": "œ",
    "262": "快",
    "263": "速",
    "264": "公",
    "265": "路",
    "266": "ň",
    "267": "Д",
    "268": "в",
    "269": "и",
    "270": "͡",
    "271": "ª",
    "272": "♥",
    "273": "Ã",
    "274": "­",
    "275": "Υ"
  },
  "special_tokens": [
    "<PAD>",
    "<BOS>",
    "<EOS>",
    "<UNK>"
  ],
  "vocab_size": 276,
  "max_lemma_length": 32
}